ERP.belugaerp/src/Catalogs/битТипыПриемкиWMS/битТипыПриемкиWMS.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>битТипыПриемкиWMS</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ПроверятьПаллеты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКоробки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПроверяемыхКоробокВПаллете</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПроверяемыхБутылокВКоробке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ERP.belugaerp/src/InformationRegisters/ПартнерыСегмента/ПартнерыСегмента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПартнерыСегмента</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions>
    <name>Сегмент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/Catalogs/битТипыПриемкиWMS/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает тип приемки по умолчанию
// 
// Возвращаемое значение:
//  СправочникСсылка.битТипыПриемкиWMS - тип приемки по умолчанию
//
Функция ТипПриемкиПоУмолчанию() Экспорт 

	Возврат бг_КонстантыПовтИсп.ЗначениеКонстанты("ТипПриемкиПоУмолчанию");	
	
КонецФункции

// Функция - Тип приемки партнера по сегменту
//
// Параметры:
//  Партнер	 - СправочникСсылка.Партнеры - партнер, для которого требуется найти тип приемки
// 
// Возвращаемое значение:
//  СправочникСсылка.битТипыПриемкиWMS - Найденный тип приемки по сегменту партнера
//
Функция ТипПриемкиПартнераПоСегменту(Партнер) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	битТипыПриемкиWMS.Ссылка КАК ТипПриемки,
	|	битТипыПриемкиWMS.КоличествоПроверяемыхКоробокВПаллете + битТипыПриемкиWMS.КоличествоПроверяемыхБутылокВКоробке КАК СуммарноеКоличествоЕдиницПроверки
	|ИЗ
	|	РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СегментыПартнеров КАК СегментыПартнеров
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.битТипыПриемкиWMS КАК битТипыПриемкиWMS
	|			ПО СегментыПартнеров.бг_ТипПриемки = битТипыПриемкиWMS.Ссылка
	|		ПО ПартнерыСегмента.Сегмент = СегментыПартнеров.Ссылка
	|ГДЕ
	|	ПартнерыСегмента.Партнер = &Партнер
	|
	|УПОРЯДОЧИТЬ ПО
	|	СуммарноеКоличествоЕдиницПроверки УБЫВ";
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Результат = Запрос.Выполнить();
	
	ТипПриемкиПартнера = Неопределено;
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		ТипПриемкиПартнера = Выборка.ТипПриемки;
	КонецЕсли;
	
	Возврат ТипПриемкиПартнера;
	
КонецФункции

#КонецОбласти
